/*
 * @lc app=leetcode.cn id=342 lang=typescript
 *
 * [342] 4的幂
 */

// @lc code=start
function isPowerOfFour(n: number): boolean {
  // 先是2，(n > 0) && (n & -n) == n
  // 1 =>  00000000000000000000000000000001
  // 4 =>  00000000000000000000000000000100
  // 16 => 00000000000000000000000000010000
  // 64 => 00000000000000000000000001000000

  // parseInt("10101010101010101010101010101010", 2) => 2863311530
  // 构造一个值：10101010101010101010101010101010，
  // 使得这个值与 4次幂 的按位与总是为 0

  return (n > 0) && (n & -n) == n && ((n & 2863311530) == 0);
};
// @lc code=end

export default isPowerOfFour;
